src/cf/DataProcessors/bon_ВыПолучилиПодарок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>bon_ВыПолучилиПодарок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомПобедит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговаяАкция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.bon_МакетинговыеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/bon_ВыдаваемыеЦенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_ВыдаваемыеЦенности</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МаркетинговойАкции</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.bon_МакетинговыеАкции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bon_ТипЦенности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВарианта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/СвободныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>СвободныеОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВРезервеСоСклада</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВРезервеПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/bon_ТипЦенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>bon_ТипЦенности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеБонусы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентБонусов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/bon_ВыПолучилиПодарок/Forms/ДаримПодарок/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Склад = Параметры.Склад;
	Объект.МаркетинговаяАкция = Параметры.МаркетинговаяАкция;
	
	ЗаполнитьНоменклатуру();
	
	Элементы.ПодарокНеНужен.Доступность = Альфа_КТ.ПроверитьДоступ("ЗаказКлиентаОтказотПодарка", ПараметрыСеанса.ТекущийПользователь, ТекущаяДата(), ТекущаяДата());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуру()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	bon_ВыдаваемыеЦенностиСрезПоследних.Значение КАК ВыдаваемыйПодарок
	|ПОМЕСТИТЬ Подарки
	|ИЗ
	|	РегистрСведений.bon_ВыдаваемыеЦенности.СрезПоследних(
	|			,
	|			ТипЦенности = ЗНАЧЕНИЕ(Перечисление.bon_ТипЦенности.Подарок)
	|				И МаркетинговойАкции = &МаркетинговойАкции) КАК bon_ВыдаваемыеЦенностиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Подарки.ВыдаваемыйПодарок КАК ВыдаваемыйПодарок
	|					ИЗ
	|						Подарки КАК Подарки)
	|				И Склад = &Склад) КАК СвободныеОстаткиОстатки
	|ГДЕ
	|	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеПодЗаказОстаток, 0) > 0";
	Запрос.УстановитьПараметр("МаркетинговойАкции", Объект.МаркетинговаяАкция);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	СписокПодарков.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ЗаполнитьНоменклатуру();
КонецПроцедуры

&НаКлиенте
Процедура МаркетинговаяАкцияПриИзменении(Элемент)
	ЗаполнитьНоменклатуру();
КонецПроцедуры

&НаКлиенте
Процедура СписокПодарковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Апаев_О Начало [16.07.2022] - "Доработка подарков акции"	
	//Подарок = СписокПодарков.НайтиПоИдентификатору(ВыбраннаяСтрока).Номенклатура;
	//ОповеститьОВыборе(Подарок);
	
	МассивПодарков = Новый Массив;
	
	Для Каждого Строка Из ВыбраннаяСтрока Цикл
		МассивПодарков.Добавить(СписокПодарков.НайтиПоИдентификатору(Строка).Номенклатура);
	КонецЦикла;
	
	ОповеститьОВыборе(МассивПодарков);
	//Апаев_О Окончание [16.07.2022]
	
КонецПроцедуры

&НаКлиенте
Процедура ПодарокНеНужен(Команда)
	ОповеститьОВыборе(Истина);
КонецПроцедуры
